perf/scenarios/sleep_spike_gunicorn.yaml
config:
  environments:
    gunicorn:
      target: 'http://localhost:5555/gunicorn'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-gunicorn"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Plain
      duration: 20
      arrivalRate: 0
    - name: Plain
      duration: 20
      arrivalRate: 5
    - name: Spike Up 1
      duration: 10
      arrivalRate: 5
      rampTo: 40
    - name: Plain 1
      duration: 10
      arrivalRate: 40
    - name: Spike Down 1
      duration: 10
      arrivalRate: 40
      rampTo: 5
    - name: Plain
      duration: 20
      arrivalRate: 5
    - name: Spike Up 2
      duration: 10
      arrivalRate: 5
      rampTo: 40
    - name: Plain 2
      duration: 10
      arrivalRate: 40
    - name: Spike Down 2
      duration: 10
      arrivalRate: 40
      rampTo: 5
    - name: Plain
      duration: 20
      arrivalRate: 0


scenarios:
  - name: Sleep (/sleep)
    flow:
      - get:
          url: '/sleep'